Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: རྗེས་སུ་ཆགས་པའི་རྟགས་དག་སྟོན་པར་བྱེད།
en: They display signs of kindness, [signs of adherence, signs of being guides, signs of leadership, and signs of reaching the end.]

source: རྗེས་སུ་འཛིན་པའི་རྟགས་དག་སྟོན་པར་བྱེད།
en: They display [signs of kindness, ]signs of adherence, [signs of being guides, signs of leadership, and signs of reaching the end.]

source: འདྲེན་པའི་རྟགས་དག་སྟོན་པར་བྱེད། །
en: They display [signs of kindness, signs of adherence, ]signs of being guides, [signs of leadership, and signs of reaching the end.]

source: རྣམ་པར་འདྲེན་པའི་རྟགས་དག་སྟོན་པར་བྱེད།
en: They display [signs of kindness, signs of adherence, signs of being guides, ]signs of leadership, [and signs of reaching the end.]

source: མུར་བྱེད་པའི་རྟགས་དག་སྟོན་པར་བྱེད་དེ།
en: They display [signs of kindness, signs of adherence, signs of being guides, signs of leadership, and ]signs of reaching the end.

source: ལྷག་པའི་བསམ་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །
en: They have altruistically set their intentions on unexcelled and perfect awakening.

source: ཀླུའི་རྒྱལ་པོ་དེ་དག་ཐམས་ཅད་ཀྱང་། །སེམས་ཅན་རྣམས་ཀྱི་དོན་བྱས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ཐེག་པས་ཡོངས་སུ་མྱ་ངན་ལས་འདའོ། །
en: All these nāga kings will benefit beings and pass beyond suffering by means of the vehicle of unexcelled and perfect awakening.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Venerable Mahā­maudgalyāyana then addressed the Blessed One.

source: འདི་ལྟར་དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་རྣམས་ཀྱི་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་མཁྱེན་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་པ་ནས། བཅོམ་ལྡན་འདས་རྫུ་འཕྲུལ་ཆེན་པོའི་བར་དང་། བཅོམ་ལྡན་འདས་གཟི་བརྗིད་ཆེན་པོའི་བར་དག་ངོ་མཚར་ཆེ་ལགས་སོ། །
en: “From the Thus-Gone One’s correct knowledge of the ripening of beings’ karma, up to the Blessed One’s great miraculous powers and right up to the Blessed One’s great majesty—all of these qualities are truly amazing.

source: བཅོམ་ལྡན་འདས་ཕྲིན་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་གང་གིས་བཅོམ་ལྡན་འདས་གནས་མཁྱེན་པ་གྲུབ་ལགས།
en: Blessed One, what action was it whose ripening led the Blessed One to attain the knowledge of what is possible?

source: བཅོམ་ལྡན་འདས་སེམས་ཅན་ཐམས་ཅད་ལ་ཐུགས་བརྩེ་བར་དགོངས་ཏེ་ལུང་བསྟན་དུ་གསོལ།
en: Blessed One, please consider all beings kindly and grant a reply.

source: ཇི་ལྟར་བཅོམ་ལྡན་འདས་ཀྱིས་ལུང་བསྟན་པ་ཐོས་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་སྤྱད་པ་སྤྱོད་པ་ན། རབ་ཏུ་དགའ་ཞིང་དགའ་བ་དང་། ཡིད་བདེ་བ་སྐྱེས་པས་སྤྱད་པ་སྤྱོད་པར་འགྱུར་ལགས་སོ། །
en: When the bodhisattva great beings hear what the Blessed One declares, they will take joy, pleasure, and delight in carrying out the practices of unexcelled and perfect awakening. Then they will engage in such practices.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One said to venerable Mahā­maudgalyāyana,

source: མཽད་གལ་གྱི་བུ་ལེགས་སོ་ལེགས་སོ། །
en: “Excellent, Maudgalyāyana, excellent.

source: མཽད་གལ་གྱི་བུ་ཁྱོད་གང་དེ་བཞིན་གཤེགས་པ་ལ་དོན་འདི་ཡོངས་སུ་ཞུ་བར་སེམས་པ་ནི། མཽད་གལ་གྱི་བུ་ཁྱོད་སྐྱེ་བོ་མང་པོ་ལ་ཕན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་། འཇིག་རྟེན་ལ་སྙིང་བརྩེ་བ་དང་། སྐྱེ་བོའི་ཚོགས་མང་པོའི་དོན་དང་ཕན་པ་དང་བདེ་བའི་ཕྱིར་ཞུགས་ཏེ
en: Maudgalyāyana, your intention in asking this question to the Blessed One is to help many beings, to bring about many beings’ welfare, and because you care for beings. You asked in order to help, benefit, and bring about the well-being of multitudes of beings.

source: ཁྱོད་དེ་བཞིན་གཤེགས་པ་ལ་དོན་འདི་ཡོངས་སུ་ཞུ་བར་སེམས་པ་ནི། ལེགས་སོ། །
en: It is excellent that you had the thought to ask this question to the Thus-Gone One.

source: མཽད་གལ་གྱི་བུ་དེའི་ཕྱིར་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་ངས་བཤད་དོ། །
en: Maudgalyāyana, listen well then, and take to heart what I am about to say.”

source: ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་བཅོམ་ལྡན་འདས་ལ་ལེགས་སོ་ཞེས་གསོལ་ཏེ།
en: “Of course,” venerable Mahā­maudgalyāyana replied to the Blessed One.

source: བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: He listened attentively to the Blessed One, who proceeded:

source: མཽད་གལ་གྱི་བུ་ང་གནས་ཤེས་པར་བྱ་བའི་དོན་དུ་འདས་པའི་དུས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ། དེ་བཞིན་གཤེགས་པ་དཔག་ཏུ་མེད་པ་དག་ལ་བསྙེན་བཀུར་བྱས་ཏེ་ཡོངས་སུ་ཞུས་སོ། །
en: “Maudgalyāyana, when in the past I was engaged in the practice of a bodhisattva, in order to know what is possible, I served and asked questions to countless thus-gone ones.

source: དགེ་བའི་རྩ་བ་བསྐྱེད་པ་དེ་དག་གི་རྣམ་གྲངས་དེས་ན་མཽད་གལ་གྱི་བུ་ཁྱོད་ཀྱིས་འདི་ལྟར་རིག་པར་བྱ་སྟེ།
en: You should understand, Maudgalyāyana, the amount of roots of virtue I created in doing so, through the following story.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མེ་ཏོག་འཛིན་ཅེས་བྱ་བ་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བ། ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་བྱུང་སྟེ
en: “Long ago, Maudgalyāyana, in the distant past there appeared in the world a thus-gone, worthy, perfect buddha named Flower Bearer; he was learned and venerable, a blissful one, a knower of the world, a steersman who guided beings, unexcelled, a teacher of gods and humans, a blessed buddha.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མེ་ཏོག་འཛིན་དེའི་ཉན་ཐོས་ཀྱི་དགེ་འདུན་བྱེ་བ་ཕྲག་དགུ་བཅུ་རྩ་དྲུག་བྱུང་ངོ་། །
en: This thus-gone, worthy, perfect buddha called Flower Bearer had a community of nine hundred sixty million hearers.

source: དེའི་ཚེ་བྲམ་ཟེ་ཨུད་པ་ལའི་མིག་ཅེས་བྱ་བ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་ཞིག་ཀྱང་བྱུང་སྟེ།
en: At that time there was a brahmin named Blue Lotus Eyes, who was similar to a great sal tree.

source: དེ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་འཛིན་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་དེ་ལ་གཙུག་ལག་ཁང་དབུལ་བ་ཕུལ་ནས་སྨོན་ལམ་བཏབ་པ།
en: He offered a monastery to the blessed thus-gone Flower Bearer and his community of hearers. While doing so, he made an aspiration:

source: བདག་གིས་བཅོམ་ལྡན་འདས་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པའི་གནས་བགྱིས་པའི་དགེ་བའི་རྩ་བ་འདིས། བཅོམ་ལྡན་འདས་བདག་གནས་ཤེས་པ་ཐོབ་པར་གྱུར་ཅིག །
en: ‘By the root of virtue from having provided a dwelling for the Blessed One and his community of hearers, O Blessed One, may I gain knowledge of what is possible.’

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་འཛིན་པ་དེས་ང་ལ་ལེགས་སོ་ཞེས་བྱ་བ་རྗེས་སུ་གནང་སྟེ།
en: “The thus-gone Flower Bearer then showed his approval to me, saying, ‘Excellent.

source: ཨུད་པ་ལའི་མིག་ལེགས་སོ་ལེགས་སོ། །
en: Excellent, Blue Lotus Eyes.

source: དགེ་བའི་རྩ་བ་འདིས་ཨུད་པ་ལའི་མིག་ཁྱོད་མ་འོངས་པའི་དུས་ན། གནས་ཤེས་པ་འཐོབ་པར་འགྱུར་རོ། །
en: By this root of virtue, Blue Lotus Eyes, in the future you will gain knowledge of what is possible.’

source: དགེ་བའི་རྩ་བ་དེས་ང་གནས་ཤེས་པ་ཐོབ་བོ། །
en: And so it was through that root of virtue that I achieved knowledge of what is possible.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསུངས་སོ། །
en: The Blessed One then spoke this verse:

source: བསམ་གཏན་པ་ཡི་གནས་བྱས་ཤིང་། །གཙུག་ལག་ཁང་ནི་ཕུལ་བ་ཡི། །དགེ་བའི་རྩ་བ་དེ་ཡིས་ན། །ངས་ནི་གནས་ཀྱི་ཤེས་པ་བསྒྲུབས། །
en: “By the root of virtue Of offering a monastery And a home for meditators, I gained knowledge of what is possible.

source: ངས་དགེ་བའི་རྩ་བ་དེ་བསྐྱེད་ནས། འདི་ལྟར་སེམས་བསྐྱེད་དེ་
en: “When I had created this root of virtue, I then formed the resolve:

source: སེམས་ཅན་གང་དག་ཕྱོགས་བཅུའི་འཇིག་རྟེན་ན་གནས་ཤེས་པ་དང་ཡང་དག་པར་ལྡན་པའི་དགེ་བའི་རྩ་བ་མངོན་པར་འདུ་བྱེད་པ་དེ་དག་ཐམས་ཅད་ཀྱི་བསོད་ནམས་ལ་རྗེས་སུ་ཡི་རང་སྟེ་ངས་རྗེས་སུ་ཡི་རང་བའི་བསོད་ནམས་དེ་ཡང་
en: ‘I rejoice in the merit of all beings in the worlds throughout the ten directions who have brought about the roots of virtue for the knowledge of what is possible;

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་སོ། །
en: I dedicate the merit from this act of rejoicing as well toward unexcelled and perfect awakening.’

source: དགེ་བའི་རྩ་བ་དེས་ང་གནས་ཤེས་པ་དང་། ཀུན་འབྱུང་བ་ཤེས་པ་འགྲུབ་བོ། །
en: It was due to that root of virtue that I came to gain knowledge of the origin as related to knowledge of what is possible.”

source: གནས་ནི་ཤེས་པར་བྱ་བའི་ཕྱིར། །གང་དག་གཡེལ་བ་མེད་སྤྱོད་པ། །དེ་ཡི་སྤྱོད་ལ་རྗེས་ཡི་རང་། །ངའི་སེམས་རྣམ་པར་མ་གཡོས་ཤིང་། །དགེ་ལ་རྗེས་སུ་ཡི་རང་སྟེ། །མི་དབང་དེ་ཡི་སྤྱོད་པ་ལ། །བསམ་པས་རྗེས་སུ་ཡི་རང་ནས། །
en: “In order to know what is possible, I rejoiced in the actions of anyone Who practiced without indolence. With my attention unwavering “I rejoiced in virtue, And bearing in mind the deeds Of such lords among men, rejoiced.

source: ངས་ནི་དེ་ལྟར་ཀུན་འབྱུང་གྲུབ། །
en: This is how I achieved knowledge of the origin.

source: ང་རྟག་པར་རྒྱུན་དུ་ཁམས་གསུམ་ལ་མ་ཆགས་པའི་ཡིད་ཀྱིས་དགེ་བའི་རྩ་བ་མངོན་པར་འདུས་བྱས་པ་དེ་དག་ལ་རྗེས་སུ་ཡི་རང་སྟེ།
en: “I constantly and continuously rejoiced in what roots of virtue had been formed, without any attachment to the three realms in my mind.

source: དེ་དག་གི་རྣམ་པར་སྨིན་པ་ལ་ཐེ་ཙོམ་མེད་པའི་དགེ་བའི་རྩ་བ་དེས་ང་གནས་ཤེས་པ་འགོག་པ་ཤེས་པ་ཐུགས་སུ་ཆུད་དོ། །
en: By the root of virtue of having no doubt about their ripening, I realized the knowledge of cessation as related to knowledge of what is possible.

source: ལམ་དེ་ཡང་བརྩོན་འགྲུས་བརྩམས་པས་ཐུགས་སུ་ཆུད་ཀྱི་ལེ་ལོས་ནི་མ་ཡིན་ཏེ།
en: I did not reach such realization by being lazy; I was diligent on this path.

source: དགེ་བའི་རྩ་བ་དེས་ང་གནས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཐུགས་སུ་ཆུད་དོ། །
en: Through such roots of virtue I realized the knowledge of the path that leads to cessation as related to knowledge of what is possible.”

source: གནས་དང་ཀུན་འབྱུང་ཤེས་པ་དང་། །དེ་བཞིན་འགོག་པ་དག་ལ་ཡང་། །ལམ་གང་གིས་ནི་དེ་འཐོབ་པ། །རྐང་གཉིས་མཆོག་ནི་དེ་མཁྱེན་ཏོ། །
en: “Knowledge of what is possible, As well as of origin , cessation, And the path to achieve these— The supreme among humans understands them.

source: ཤེས་པ་དེ་དང་ལྡན་པ་ཡི། །བྱང་ཆུབ་སེམས་དཔའ་འཇིགས་མེད་པ། །འཇིག་རྟེན་ཀུན་ལ་ཕན་པའི་ཕྱིར། །འདྲེན་པས་དེ་ནི་གྲོལ་བར་བྱེད། །
en: “In order to help all beings, The fearless bodhisattvas Who possess such knowledge Guide and liberate them.”

source: མཽད་གལ་གྱི་བུ་ང་གནས་མ་ཡིན་པ་ཤེས་པར་བྱ་བའི་དོན་དུ་དགེ་བའི་རྩ་བ་དཔག་ཏུ་མེད་པ་དག་བསྐྱེད་དེ།
en: “Maudgalyāyana, I also created an unfathomable amount of roots of virtue for the purpose of knowledge of what is impossible.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ན། དེ་བཞིན་གཤེགས་པ་མི་གནས་པར་སྤྱོད་པ་ཞེས་བྱ་བ་སྟོན་པ་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: Long ago in the limitless cycle of existence, Maudgalyāyana, in the distant past there appeared in the world a thus-gone named Non-Abiding Action.

source: དེ་བཞིན་གཤེགས་པ་མི་གནས་པར་སྤྱོད་པ་དེའི་ཉན་ཐོས་འདུས་པ་གཅིག་ནི་དྲུག་ཁྲི་བརྒྱད་སྟོང་བྱུང་ངོ་། །
en: The thus-gone Non-Abiding Action had a gathering of sixty-eight thousand hearers.

source: དེའི་ཚེ་ན་ཁྱིམ་བདག་ཐོས་སྤྱོད་ཅེས་བྱ་བ་ཞིག་ཀྱང་བྱུང་སྟེ། དེས་དེ་བཞིན་གཤེགས་པ་མི་གནས་པར་སྤྱོད་པ་དེའི་ཡོ་བྱད་ཐམས་ཅད་སྦྱར་ནས་སྨོན་ལམ་འདི་སྐད་བཏབ་བོ། །
en: At that time there was a householder named Listening Practice, who supplied the thus-gone Non-Abiding Action with all his belongings and then made the prayer:

source: བདག་དགེ་བའི་རྩ་བ་འདིས་མི་གནས་པའི་ཆོས་ཐོབ་པར་གྱུར་ཅིག་ཅེས་བཏབ་སྟེ
en: ‘By this root of virtue, may I achieve the non-abiding Dharma.’

source: དེའི་རྒྱུར་བྱས་པའི་ཆོས་གང་ལ་ཡང་སྨོན་ལམ་མ་བཏབ་བོ། །
en: At the same time, he did not form any aspirations to gain any wealth thereby.

source: དགེ་བའི་རྩ་བ་མངོན་པར་འདུས་བྱས་པ་དེས་ང་སྲིད་པ་པ་དང་། འགྲོ་བ་དང་། འཆི་བ་དང་། སྐྱེ་བ་ཐམས་ཅད་ལ་གང་གི་གཞིའི་གནས་ལྡོག་པ་ནི་ང་ལ་མེད་དེ
en: Because of forming such roots of virtue, I have now fully overcome the basis for further existence, transmigration, death, or rebirth.

source: དགེ་བའི་རྩ་བ་དེས་ང་གནས་མ་ཡིན་པ་ཤེས་པ་ཐུགས་སུ་ཆུད་དོ། །
en: It is due to this root of virtue that I realized knowledge of what is impossible.”

source: རྟེན་པ་མེད་པའི་སེམས་ཀྱིས་སུ། །ཚུལ་ཁྲིམས་བཟོད་པའི་སྟོབས་ལ་བརྟེན། །གང་གིས་འགྲོ་བ་སྤུངས་བྱས་པ། །གནས་མ་ཡིན་གྱི་ཤེས་པ་ཐོབ། །
en: “He who rallied beings, While applying the powers of discipline and patience With a mind that did not rely on anything, Achieved knowledge of what is impossible.

source: ངས་སེམས་ཅན་དཔག་ཏུ་མེད་པ་དག་གནས་མ་ཡིན་པ་ཤེས་པ་ལ་བཙུད་ཅིང་དགེ་བའི་རྩ་བ་ཡང་བསྐྱེད་ལ།
en: “I brought countless sentient beings to knowledge of what is impossible, thereby creating roots of virtue;

source: ང་དགེ་བའི་རྩ་བ་དེ་དག་ལ་ཡང་གུས་པར་རྗེས་སུ་ཡི་རང་སྟེ།
en: I then rejoiced in those roots of virtue.

source: དགེ་བའི་རྩ་བ་དེས་ང་གནས་མ་ཡིན་པ་ཤེས་པ་དང་། ཀུན་འབྱུང་བ་ཤེས་པ་མངོན་པར་གྲུབ་བོ། །
en: Due to those roots of virtue I accomplished knowledge of the origin as related to knowledge of what is impossible.

source: དགེ་བའི་རྩ་བ་དེ་དག་ཀྱང་ངས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མ་གཏོགས་པར་ཕུང་པོ་དག་མངོན་པར་འགྲུབ་པར་བྱེད་པ་གར་ཡང་མ་བསྔོས་སོ། །
en: Moreover, I dedicated those roots of virtue exclusively toward unexcelled and perfect awakening, and never toward manifesting aggregates.

source: དགེ་བའི་རྩ་བ་དེས་ང་གནས་མ་ཡིན་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་མངོན་པར་གྲུབ་བོ། །
en: It was through those roots of virtue that I accomplished knowledge of cessation as related to knowledge of what is impossible.

source: ང་ལམ་གྱི་ཤེས་པ་འདི་བསྒྲུབ་པའི་དོན་དུ་འདི་ལྟ་སྟེ།
en: “I also created countless roots of virtue toward the purpose of achieving knowledge of the path.

source: དགེ་བའི་རྩ་བ་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་པ་ནི་མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ན་དེ་བཞིན་གཤེགས་པ་ཟུག་རྔུ་འབྱིན་ཅེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ། དེའི་ཉན་ཐོས་འབུམ་ཚང་བར་བྱུང་ངོ་། །
en: Long ago in the limitless cycle of existence, Maudgalyāyana, in the distant past there appeared in the world a thus-gone named Extractor of Thorns, with a full hundred thousand hearers.

source: དེའི་ཚེ་དབང་པོས་བྱིན་ཞེས་བྱ་བ་བྲམ་ཟེ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་ཞིག་ཀྱང་བྱུང་སྟེ།
en: At that time there was a brahmin, who was similar to a great sal tree, named Indradatta.

source: དེ་དེ་བཞིན་གཤེགས་པ་ཟུག་རྔུ་འབྱིན་པ་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པའི་ཡོ་བྱད་ཐམས་ཅད་ལོ་ཁྲིར་སྦྱར་ཏོ། །
en: He supplied the thus-gone Extractor of Thorns as well as his community of hearers with all their necessities for ten thousand years.

source: མཽད་གལ་གྱི་བུ་དེའི་ཚེ་དེའི་དུས་ན་དབང་པོས་བྱིན་ཞེས་བྱ་བ་བྲམ་ཟེ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ
en: Maudgalyāyana, in case you may think that at that time Indradatta, the brahmin similar to a great sal tree, was anyone else, do not think so.

source: དེའི་ཚེ་དེའི་དུས་ན་ང་བྲམ་ཟེ་དབང་པོས་བྱིན་ཞེས་བྱ་བ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུར་གྱུར་ཏོ། །
en: Because in those days I was Indradatta, the brahmin similar to a great sal tree.

source: མཽད་གལ་གྱི་བུ་ཆེན་པོ་དེ་ལྟ་བས་ན། གནས་མ་ཡིན་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པར་འདོད་པའི་བྱང་ཆུབ་སེམས་དཔས་དགེ་བ་མངོན་པར་འདུས་བྱས་ཏེ། བག་ཡོད་པས་གནས་མ་ཡིན་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པར་ཡོངས་སུ་བསྔོ་བར་བྱའོ། །
en: Therefore, Mahā­maudgalyāyana, bodhisattvas who seek knowledge of the path that leads to cessation as related to knowledge of what is impossible should create virtue, and then conscientiously dedicate it toward knowledge of the path that leads to cessation as related to knowledge of what is impossible.

source: མཽད་གལ་གྱི་བུ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པས་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན། ལྷག་པའི་ཚུལ་ཁྲིམས་ཀྱི་བསླབ་པ་ཡང་དག་པར་བླང་བ་ལ་ཀུན་ཏུ་བསྟེན་ཅིང་བསྒོམས་ཏེ་མང་དུ་མཛད་དོ། །
en: “Maudgalyāyana, when the Thus-Gone One was training in the practices of a bodhisattva in the past, I made use of the higher training in discipline—applying it and training in it to a great extent.

source: དེ་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་དེས་ཞབས་ཤིན་ཏུ་བརྟན་པར་གནས་ཏེ། སྐུ་ལ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་མངའ་བར་གྱུར། ཕྱག་བཟང་ཞིང་དཔེ་བྱད་མངའ་བར་གྱུར་ཅིང་གནས་མ་ཡིན་པ་ཤེས་པའང་བརྙེས་སོ། །
en: As the karma from doing so ripened, my lifespan became stable, my body came to possess the major marks of a great being, my hands became superb, and I gained the minor marks as well. In addition, I gained the knowledge of what is impossible.

source: ལྷག་པའི་ཚུལ་ཁྲིམས་ཀྱི་བསླབ་པ་ཡང་དག་པར་བླང་བ་དེ་ལ་སྐྱེ་བོ་མང་པོ་ཡང་དག་པར་འཛིན་དུ་བཅུག་སྟེ། དགེ་བའི་རྩ་བ་དེས་ང་གནས་མ་ཡིན་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་བརྙེས་སོ།། །།
en: I caused numerous beings to uphold the application of the higher training in discipline, and then by those roots of virtue, I gained knowledge of the origin as related to knowledge of what is impossible.

source: ངས་ལྷག་པའི་ཚུལ་ཁྲིམས་ཀྱི་བསླབ་པ་ཡང་དག་པར་བླང་བ་དེའི་བསྔགས་པ་བརྗོད་དེ། དེའི་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་དེས་ང་གནས་མ་ཡིན་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་བརྙེས་སོ། །
en: “If I may extol my application of the higher training in discipline, it is due to the ripening of the karma associated with it that I gained knowledge of cessation as related to knowledge of what is impossible.

source: ལྷག་པའི་ཚུལ་ཁྲིམས་ཀྱི་བསླབ་པ་ཡང་དག་པར་བླང་བ་དེ་ལ་ངས་སྐྱེ་བོའི་ཚོགས་མང་པོ་རབ་ཏུ་བཀོད་དེ།
en: I also inspired numerous multitudes of beings to genuinely apply the higher training in discipline as well.

source: ལས་ཀྱི་རྣམ་པར་སྨིན་པ་དེས་ང་གནས་མ་ཡིན་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་བརྙེས་སོ། །
en: It is due to the ripening of the karma associated with that that I gained knowledge of the path that leads to cessation as related to knowledge of what is impossible.

source: ངས་ཕྱིར་མི་འཕྲོགས་པ་ཡང་ཐུགས་སུ་ཆུད་དེ།
en: Thus I realized the state of being utterly dependable.

source: མཽད་གལ་གྱི་བུ་ང་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་དམ་བཅས་པ་ལས་ནམ་ཡང་འགལ་བར་མ་བྱས་ཏེ། ངས་ཇི་ལྟར་དམ་བཅས་པ་དེ་ལྟར་བྱས་སོ། །
en: Maudgalyāyana, I have never broken the promises I made in the past when I was in training as a bodhisattva—I followed through with my promises exactly as I made them.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་རྒྱལ་པོ་དཔལ་གྱི་སྙིང་པོ་ཞེས་བྱ་བ་གདུགས་གཅིག་པ་ས་རྣམས་ཀྱི་དབང་ཕྱུག་སྦྱིན་པ་པོ་སྦྱིན་བདག་དམ་བཅས་པར་དོན་ཡོད་པར་བྱེད་པ། དམ་བཅས་པ་ལས་མི་འདའ་བ་ཞིག་བྱུང་ངོ་། །
en: “Long ago, Maudgalyāyana, long before even the distant past there was a patron-king named Śrīgarbha, who reigned over numerous regions, which were under the single umbrella of his command. He was true to his promises and never went against them.

source: དེའི་ཚེ་བྲམ་ཟེ་ཚངས་པའི་ལྷ་ཞེས་བྱ་བ་ཞིག་རྒྱལ་པོ་དཔལ་གྱི་སྙིང་པོ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་རྒྱལ་བ་ཞེས་བརྗོད་དེ། ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་བླངས་པ།
en: At this time there was also a brahmin named Brahmadeva, who paid a visit to King Śrīgarbha and sang to him this verse:

source: ས་དབང་དཔལ་གྱི་སྙིང་པོ་རྒྱལ་བར་སྤྱོན། །ཡོན་ཏན་ལྡན་པས་རྒྱ་མཚོ་སར་བཅས་སྐྱོངས། །
en: “ ‘Lord Śrīgarbha, you’ve become victorious, Ruling the land and seas with your virtues.

source: བདག་གི་མཆིས་བྲང་དུ་ནི་སྲས་མོ་སྩོལ། །
en: Please grant me your daughter for a wife—

source: བདག་སློང་འབྲས་བུ་ཡོད་པར་རྒྱལ་པོས་མཛོད། །
en: O King, please help make my wishes bear fruit.’

source: བྲམ་ཟེ་དེ་དཀའ་ཐུབ་སྤྱོད་པ་ཡིན་ཏེ།
en: “The brahmin was an ascetic, his body emaciated.

source: བདག་གི་ལུས་ཤིན་ཏུ་སྐེམ་ལ་སྐྲ་སེར། སོ་མི་སྡུག་ཅིང་དཀར་ལ་གཙིགས་པ།
en: He had blond hair and bared a set of revolting teeth.

source: ཤེལ་གྱི་མིག་ལ་བལྟ་ན་མི་བཟད་ཅིང་། རལ་པའི་ཐོར་ཚུགས་ཅན་དེ་མཐོང་ནསརྒྱལ་པོ་དེ་འཇིགས་ཤིང་སྐྲག་ལ་མི་དགའ་སྟེ། བ་སྤུའི་ཁུང་བུ་ཟིང་ཞེས་བྱེད་པར་གྱུར་པ་ནས། འཇིགས་པར་སེམས་པའི་རྗེས་སུ་ཞུགས་པའི་བར་དུ་གྱུར་ཏེ།
en: His eyes were like glass and looked hideous, and his hair was tied up in braids. Seeing him the king was shocked, scared, disgusted, and had goose bumps. He even fell into a state of panic, as he thought,

source: གལ་ཏེ་བུ་མོ་འདི་མ་བྱིན་ན། དེ་བདག་ལ་དམོད་པ་བྱེད་པར་འགྱུར།
en: ‘If I don’t give him my daughter, he’ll surely put a curse on me.

source: གཞན་ཡང་བདག་གིས་སེམས་ཅན་ཐམས་ཅད་ལ་བཀུར་སྟི་བྱ་བ་ཡིན་ཏེ། བདག་གིས་དམ་བཅས་པ་དང་ཡང་འགལ་བར་འགྱུར་རོ་སྙམ་མོ། །
en: Nonetheless, I have vowed to serve all sentient beings and shall not go against my word.’

source: བུ་མོ་དེ་ནི་ཡུལ་གྱི་བཟང་མོ་ཞེས་བྱ་སྟེ། གཟུགས་བཟང་ཞིང་མཛེས་ལ་བལྟ་ན་སྡུག་པ། རྒྱལ་པོའི་ཁྱད་པར་དུ་འཕགས་པའི་ཚུལ་ཐམས་ཅད་དང་ལྡན་པ་ཞིག་བྱུང་བར་གྱུར་ཏོ། །
en: His daughter, whose name was Jana­pada­kalyāṇī—‘Good Lady of the Land’—was beautiful and lovely and she bore all the special features of royalty.

source: དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: He continued to reflect,

source: བདག་གིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བར་དེ་ལྟར་བདག་གིས་དམ་བཅས་ན།
en: ‘I have vowed to fulfill the wishes of all sentient beings.

source: དྲང་སྲོང་འདི་ནི་གཟུགས་མི་སྡུག་ལ། བདག་གི་བུ་མོ་འདི་ནི་མཆོག་ཏུ་གཟུགས་བཟང་བ་ཡིན་ཏེ།
en: Yet this ascetic is too ugly for my daughter, who is so ravishing.

source: འདི་ལྟར་དེའི་བདག་པོར་མི་དགའ་བར་འགྱུར་བས་དམ་བཅས་པ་གཞིག་པར་བྱའོ་སྙམ་སྟེ།
en: I would not be happy if he had her for himself, and therefore I must break my vow.’

source: དེ་སེམས་པ་འདི་ལ་ཞུགས་ནས་སེམས་ཁོང་དུ་ཆུད་ཅིང་འདུག་གོ། །
en: He stayed for some time pondering this, absorbed in his thoughts.

source: དེ་ནས་བུ་མོ་ཡུལ་གྱི་བཟང་མོ་དེས།
en: Eventually his daughter came to him and spoke this verse:

source: ཕ་དེ་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ། ཡབ་ཅིག་དགོངས་ཤིང་ཤིན་ཏུ་དགོངས་པར་མཛད། །
en: “ ‘Father, consider and consider well!

source: བྲམ་ཟེའི་ཚིག་ལས་འགལ་བར་མ་མཛད་ཅིག །
en: Please don’t refuse the brahmin’s request.

source: འདི་འདྲའི་ལས་ཀྱིས་བདག་བསྐྱེད་ཡབ་ཡུམ་ལའང་། །དབང་མི་མངའ་བས་ཁྱིམ་ཐབ་དེ་སྩོལ་ཅིག །
en: Even my own parents who created me Do not have authority to do that, so please let us marry.’

source: དེ་ནས་རྒྱལ་པོ་དཔལ་གྱི་སྙིང་པོ་བུ་མོ་དེའི་ཚིག་ཐོས་ནས། མགུ་ཞིང་དགའ་ལ་ཡི་རངས་ཏེ།
en: “When King Śrīgarbha heard what she said, he was pleased, delighted, and overjoyed.

source: རབ་ཏུ་དགའ་ཞིང་བདེ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ནས། བུ་མོ་ཡུལ་གྱི་བཟང་མོ་དེ་བྲམ་ཟེ་དེ་ལ་བྱིན་ནོ། །
en: Feeling joyful, elated, and happy, he offered his daughter Jana­pada­kalyāṇī to the brahmin.

source: དེ་ནས་བྲམ་ཟེ་དེས་བུ་མོ་དེ་བླངས་ནས་སོང་སྟེ།
en: The brahmin then took the girl with him and departed.

source: བུ་བསྐྱེད་ནས་ཆུང་མ་དང་བུ་བཞག་སྟེ། ཡང་རབ་ཏུ་བྱུང་ངོ་། །
en: They had a son who also took a wife and had a son, and then took ordination.

source: རྒྱལ་པོ་དེས་བྲམ་ཟེ་དེའི་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་བྱས་པའི་དགེ་བའི་རྩ་བ་དེས་གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷ་རྣམས་དང་བརྟུལ་ཞུགས་འདྲ་བར་སྐྱེས་ཏེ།
en: The root of virtue the king created in fulfilling the brahmin’s wishes led him to be reborn like an ascetic among the gods who make use of others’ emanations.

source: དེ་འདོད་པ་ན་སྤྱོད་པའི་ལྷའི་རིས་དྲུག་གི་ཚེའི་ཚད་ཡོངས་སུ་རྫོགས་པར་བྱས་ནས། མིར་སྐྱེས་པ་ན་ཕྱིར་མི་འཕྲོགས་པའི་ཆོས་ཐམས་ཅད་ཐོབ་བོ། །
en: When he had reached the end of the life span of the six classes of desire realm gods, he was again born as a human and attained all of the inalienable qualities.

source: མཽད་གལ་གྱི་བུ་དེའི་ཚེ་དེའི་དུས་ན། རྒྱལ་པོ་དཔལ་གྱི་སྙིང་པོ་ཞེས་བྱ་བ་དེ་གཞན་མ་ཡིན་ཏེ།
en: Maudgalyāyana, at that time King Śrīgarbha was none other than me;

source: ང་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་དཔལ་གྱི་སྙིང་པོ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: I was King Śrīgarbha then.

source: དགེ་བའི་རྩ་བ་དེས་ང་གནས་མ་ཡིན་པ་ཤེས་པ་ཐོབ་ཅིང་བདུད་ཀྱི་ཞགས་པ་ཐམས་ཅད་ཀྱིས་ཀྱང་ཕྱིར་མི་འཕྲོགས་སོ། །
en: Due to that root of virtue I achieved knowledge of what is impossible, never to be caught again in any of the nooses of evil.

source: མཽད་གལ་གྱི་བུ་དེས་ན་ང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན། སེམས་ཅན་དཔག་ཏུ་མེད་པ་དགེ་བའི་རྩ་བ་འདི་ཡང་དག་པར་འཛིན་དུ་བཅུག་པའི་དགེ་བའི་རྩ་བ་དེས། ང་གནས་མ་ཡིན་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཐོབ་ཅིང་།
en: “Therefore, Maudgalyāyana, when I was involved in the trainings of a bodhisattva, I led limitless sentient beings to adopt the roots of virtue. It was due to the roots of virtue from doing so that I achieved knowledge of the origin as related to knowledge of what is impossible.

source: དགེ་བའི་རྩ་བ་འདིའི་རྣམ་པར་སྨིན་པ་ལ་ཐེ་ཙོམ་མེད་དེ། དེའི་ལས་ཀྱི་རྣམ་པར་སྨིན་པས་ང་གནས་མ་ཡིན་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་ཐུགས་སུ་ཆུད་པ། མཚན་དང་དཔེ་བྱད་ཕུན་སུམ་ཚོགས་པའང་བརྙེས་སོ། །
en: Without a doubt those roots of virtue came to ripen, and when the karma came to ripen I gained realization of the knowledge of cessation as related to knowledge of what is impossible, as well as the perfect major and minor marks.
